# PANDAS

Import pandas as pd

To install pandas

pip install pandas / command line

or

conda install pandas

-	Transform
-	Clean
-	Visualize
-	Extract

## 1. DataFrame

In [1]:
scores = {"name": ['Tazeb', 'Betty', 'Absalat'],
          "BirthDay": ['05/1980', '10/1981', '04/2020']}

In [2]:
import pandas as pd
df = pd.DataFrame(scores)

In [3]:
df

      name BirthDay
0    Tazeb  05/1980
1    Betty  10/1981
2  Absalat  04/2020

In [4]:
#df['name']
df.name

0      Tazeb
1      Betty
2    Absalat
Name: name, dtype: object

In [10]:
# creating new data frame by passing new column name

df['palce_year'] = df["name"] + '-' + df["BirthDay"]

In [12]:
df

      name BirthDay       palce_year  palce_birth
0    Tazeb  05/1980    Tazeb-05/1980       Gondar
1    Betty  10/1981    Betty-10/1981  Addis_Ababa
2  Absalat  04/2020  Absalat-04/2020        Dalls

In [14]:
df['palce_birth'] =  ['Gondar', 'Addis Ababa', 'Dalls']

In [15]:
df

      name BirthDay       palce_year  palce_birth
0    Tazeb  05/1980    Tazeb-05/1980       Gondar
1    Betty  10/1981    Betty-10/1981  Addis Ababa
2  Absalat  04/2020  Absalat-04/2020        Dalls

In [17]:
df[df['palce_birth'] == "Gondar"]

    name BirthDay     palce_year palce_birth
0  Tazeb  05/1980  Tazeb-05/1980      Gondar

### Importing data sources

* CSV
* Excel
* JSON
* Databases
* Parquest
* etc


iris = pd.read_csv("/iris.csv")

* iris.shape
* iris.head(5)
* iris.tail(5)
* iris.dtypes
* iris.loc[3:5]
* iris.loc[3, 'sepal_length']
* iris.iloc[3,0]

### Exporting data as csv using to_csv

iris.to_csv('iris-output.csv, index=False')

# Pandas OPTIONS

In [19]:
emissions = pd.DataFrame({"Contry": ['China', 'USA', 'India'],
                         "Yeat": ['2018', '2018', '2018'],
                         "CO2_emmissions": [100600000.0, 541000000, 2650000000]})

In [20]:
emissions

  Contry  Yeat  CO2_emmissions
0  China  2018    1.006000e+08
1    USA  2018    5.410000e+08
2  India  2018    2.650000e+09

In [27]:
pd.set_option('max_rows', 2)
emissions

   Contry  Yeat  CO2_emmissions
0   China  2018    1.006000e+08
..    ...   ...             ...
2   India  2018    2.650000e+09

[3 rows x 3 columns]